/*
 * 
 * 2차 for문
 * 
 * 		중첩
 * 		조건문
 * 			if() {
 * 				if() {
 * 				}
 * 			{
 * 
 * 
 * 			switch() {
 * 				case 값:
 * 					switch() {
 * 					}
 * 			}
 * 
 * 
 * 			for() {			>> 줄수
 * 				for() {		>> 출력 갯수
 * 				}
 * 			}
 * 
 * 		1	2	3	4	5		>> 4줄, 20개
 * 		6	7	8	9	10
 * 		11	12	13	14	15
 * 		16	17	18	19	20
 * 
 * 		A	B	C				>> 5줄, 12개
 * 		D	E	F
 * 		G	H	I
 * 		J	K	L
 * 		M	N	O
 * 	
 * 			  1		2	(마지막)
 * 		for(초기값; 조건식; 증가식) {			>> 줄수
 * 				 ㅣ 
 * ---------------------------------------------
 * 				 1		2	  4
 * 			for(초기값; 조건식; 증가식) {		>> 실제 출력물
 * 				반복수행문장  3
 * 				}						>> 2번이 false일 때 종료인데, 2차 중첩이니까 1차 for문에 증가식으로 올라감
 * ---------------------------------------------
 * 			다음줄로 내려준다
 * 		}
 * 
 * 		2*1=2 3*1=3 ...9*1=9			>> 9줄, 8개 출력(1줄에)
 * 		--
 * 		--
 * 		2*9=18 3*9=27... 9*9=8
 */
public class 중첩반복문_1 {

	public static void main(String[] args) {
		
//		char c ='A';
//		for(int i = 1; i <=5; i++) {			// 줄수
//			for(int j = 1; j <=3; j++)	{
//				System.out.print(c++);
//			}
//			System.out.println();
//		}
		
//=====================================================================
		
		for(int i =1; i <=5; i++) {
			for(int j = 1; j <=5; j++) {
				System.out.println("i = "+i+" , j ="+j);	// 여기 조건이 끝나야 1차 for문으로 이동하여 증가한다
				
			}
		}
		
		/*
		 * i=1, j=1
		 * i=1, j=2
		 * i=1, j=3
		 * i=1, j=4
		 * i=1, j=5
		 * 
		 * i=2, j=1
		 * i=2, j=2
		 * i=2, j=3
		 * i=2, j=4
		 * i=2, j=5		  
		 * 
		 * 
		 */
		
//=====================================================================	

		System.out.println("구구단");
		
		for(int i = 1; i <=9; i++) {
			for(int j=2; j <= 9; j++)
				System.out.printf("%2d*%2d=%2d\n",i,j,i*j);
		}
		
		System.out.println();
		
		
	}

}
