/*
 * 
 * 1. 단일 조건문
 * 		형식)
 * 			if(조건) {
 * 				조건문이 true면 수행되는 문장
 * 				}
 * -------------------------------------단일조건문은 부정연산자(!), 비교연산자(==,!=,<,>,<=,>=), 논리연산자(&&, ||)만 사용 가능
 * 
 * 2. 선택 조건문
 * 		형식)
 * 			if(조건문) {
 * 				조건문이 true면 수행되는 문장
 * 			} else {
 * 				조건문이 false면 수행되는 문장		>> 위에 있는 if문 소속이다 , else는 단독으로 사용할 수 없다
 * 			} 
 * 			
 * 3. 다중 조건문
 * 		형식)
 * 			if(조건문) {
 * 				조건문이 true면 수행되는 문장  >> true면 여기서 종료, false가 되면 밑으로 하나씩 내려간다
 * 			} else if {
 * 			
 *  		} else if {
 * 			
 * 			} else {
 * 				위 해당 조건이 없을 때 수행되는 문장
 * 			}
 * 
 * 4. 선택문
 * 5. 반복문 (for - 1차)
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
public class 제어문_정리 {

	public static void main(String[] args) {
		

	}

}
